Results/Swarm/13-01-22/1/swarm-sn-wrk-mixed-c6525-25g-exp1-havail0-hori1-verti1-infi1-client1-t4-c8-d30-R500
Using argument nginx
using  args: threads=4 and connections=8 and duration=30 and requests=500
Running 30s test @ http://10.10.1.4:8080
  4 threads and 8 connections
  Thread calibration: mean lat.: 2.001ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.971ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.907ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.016ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.61ms    1.86ms   8.05ms   78.72%
    Req/Sec   131.74    118.05   444.00     57.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.67ms
 75.000%    4.09ms
 90.000%    5.24ms
 99.000%    8.05ms
 99.900%   11.01ms
 99.990%   13.06ms
 99.999%   13.09ms
100.000%   13.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.515     0.000000            1         1.00
       0.952     0.100000         1003         1.11
       1.098     0.200000         2003         1.25
       1.253     0.300000         3003         1.43
       1.451     0.400000         4004         1.67
       1.670     0.500000         5003         2.00
       1.822     0.550000         5502         2.22
       2.101     0.600000         6000         2.50
       3.131     0.650000         6501         2.86
       3.755     0.700000         7003         3.33
       4.085     0.750000         7503         4.00
       4.255     0.775000         7753         4.44
       4.443     0.800000         8004         5.00
       4.607     0.825000         8252         5.71
       4.803     0.850000         8503         6.67
       5.007     0.875000         8752         8.00
       5.119     0.887500         8877         8.89
       5.247     0.900000         9002        10.00
       5.387     0.912500         9125        11.43
       5.563     0.925000         9250        13.33
       5.775     0.937500         9375        16.00
       5.891     0.943750         9437        17.78
       6.007     0.950000         9500        20.00
       6.187     0.956250         9567        22.86
       6.383     0.962500         9625        26.67
       6.575     0.968750         9687        32.00
       6.687     0.971875         9718        35.56
       6.835     0.975000         9750        40.00
       6.999     0.978125         9782        45.71
       7.223     0.981250         9812        53.33
       7.439     0.984375         9843        64.00
       7.587     0.985938         9859        71.11
       7.771     0.987500         9875        80.00
       7.951     0.989062         9890        91.43
       8.123     0.990625         9906       106.67
       8.295     0.992188         9921       128.00
       8.495     0.992969         9929       142.22
       8.655     0.993750         9937       160.00
       8.831     0.994531         9945       182.86
       9.023     0.995313         9953       213.33
       9.391     0.996094         9960       256.00
       9.455     0.996484         9964       284.44
       9.631     0.996875         9968       320.00
       9.895     0.997266         9973       365.71
      10.015     0.997656         9977       426.67
      10.215     0.998047         9980       512.00
      10.303     0.998242         9982       568.89
      10.343     0.998437         9984       640.00
      10.447     0.998633         9986       731.43
      10.975     0.998828         9988       853.33
      11.167     0.999023         9990      1024.00
      11.231     0.999121         9991      1137.78
      11.247     0.999219         9992      1280.00
      11.535     0.999316         9993      1462.86
      11.543     0.999414         9994      1706.67
      12.023     0.999512         9995      2048.00
      12.023     0.999561         9995      2275.56
      12.047     0.999609         9996      2560.00
      12.047     0.999658         9996      2925.71
      12.103     0.999707         9997      3413.33
      12.103     0.999756         9997      4096.00
      12.103     0.999780         9997      4551.11
      13.063     0.999805         9998      5120.00
      13.063     0.999829         9998      5851.43
      13.063     0.999854         9998      6826.67
      13.063     0.999878         9998      8192.00
      13.063     0.999890         9998      9102.22
      13.087     0.999902         9999     10240.00
      13.087     1.000000         9999          inf
#[Mean    =        2.612, StdDeviation   =        1.863]
#[Max     =       13.080, Total count    =         9999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14983 requests in 30.00s, 34.49MB read
Requests/sec:    499.40
Transfer/sec:      1.15MB